Revit 2027 API
AnalysisDisplayStyle.CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayVectorSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) Method
 Factory method - creates analysis display style object of type Vectors for the given document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AnalysisDisplayStyle CreateAnalysisDisplayStyle(
	Document document,
	string name,
	AnalysisDisplayVectorSettings vectorSettings,
	AnalysisDisplayColorSettings colorSettings,
	AnalysisDisplayLegendSettings legendSettings
)
Public Shared Function CreateAnalysisDisplayStyle (
	document As Document,
	name As String,
	vectorSettings As AnalysisDisplayVectorSettings,
	colorSettings As AnalysisDisplayColorSettings,
	legendSettings As AnalysisDisplayLegendSettings
) As AnalysisDisplayStyle
public:
static AnalysisDisplayStyle^ CreateAnalysisDisplayStyle(
	Document^ document,
	String^ name,
	AnalysisDisplayVectorSettings^ vectorSettings,
	AnalysisDisplayColorSettings^ colorSettings,
	AnalysisDisplayLegendSettings^ legendSettings
)
static member CreateAnalysisDisplayStyle :
        document : Document *
        name : string *
        vectorSettings : AnalysisDisplayVectorSettings *
        colorSettings : AnalysisDisplayColorSettings *
        legendSettings : AnalysisDisplayLegendSettings -> AnalysisDisplayStyle
Parameters
document Document
 Document for which analysis display style object is created.
name String
 Name of the analysis display style within the %document%.
vectorSettings AnalysisDisplayVectorSettings
 Vector settings for the style.
colorSettings AnalysisDisplayColorSettings
 Color settings for the style.
legendSettings AnalysisDisplayLegendSettings
 Legend settings for the style.
Return Value
AnalysisDisplayStyle
 New analysis display style object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  document is a family. -or- name is not unique in document.
See Also
Reference
AnalysisDisplayStyle Class
CreateAnalysisDisplayStyle Overload
Autodesk.Revit.DB.Analysis Namespace